       01 ws-clnt-record.
           05 ws-clnt-id            pic 9(7).
           05 ws-clnt-surname       pic X(10).
           05 ws-clnt-dob           pic 9(6).
           05 ws-clnt-balance       pic S9(5)V9(2) comp-3 value zeroes.
      *EOF.