       01 ws-cont-record.
           05 ws-cont-id           pic 9(1) value zero.
           05 ws-cont-next-clnt-id pic 9(7) value zeroes.
      *EOF.